---
kind: property
id: P:Autodesk.Revit.DB.Wall.CurtainGrid
zh: 墙、墙体
source: html/7d46f445-4739-1877-c9de-e04787d7257b.htm
---
# Autodesk.Revit.DB.Wall.CurtainGrid Property

**中文**: 墙、墙体

Get the grid object of a curtain wall

## Syntax (C#)
```csharp
public CurtainGrid CurtainGrid { get; }
```

## Remarks
This property is readonly.